/*
Navicat MySQL Data Transfer

Source Server         : localhost_3306
Source Server Version : 50505
Source Host           : localhost:3306
Source Database       : xscjglxt

Target Server Type    : MYSQL
Target Server Version : 50505
File Encoding         : 65001

Date: 2024-05-23 23:18:37
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for cjxx
-- ----------------------------
DROP TABLE IF EXISTS `cjxx`;
CREATE TABLE `cjxx` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `xsname` varchar(255) DEFAULT NULL,
  `kcid` int(11) DEFAULT NULL,
  `zycj` varchar(255) DEFAULT NULL,
  `qmcj` varchar(255) DEFAULT NULL,
  `scsj` date DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=52 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

-- ----------------------------
-- Records of cjxx
-- ----------------------------
INSERT INTO `cjxx` VALUES ('1', '陈俊萍', '1', '99', '99', '2024-04-22');
INSERT INTO `cjxx` VALUES ('2', '黄楠敏', '2', '98', '98', '2024-04-23');
INSERT INTO `cjxx` VALUES ('3', '刘雪琪', '1', '89', '89', '2024-04-24');
INSERT INTO `cjxx` VALUES ('4', '马丹儿', '3', '56', '56', '2024-04-24');
INSERT INTO `cjxx` VALUES ('5', '马佳柔', '4', '87', '87', '2024-04-25');
INSERT INTO `cjxx` VALUES ('6', '马嘉丽', '5', '74', '74', '2024-04-25');
INSERT INTO `cjxx` VALUES ('7', '马静琦', '2', '66', '66', '2024-04-24');
INSERT INTO `cjxx` VALUES ('8', '马莹琦', '3', '88', '88', '2024-04-25');
INSERT INTO `cjxx` VALUES ('9', '彭申艺', '1', '75', '75', '2024-05-22');
INSERT INTO `cjxx` VALUES ('10', '吴文琪', '1', '65', '65', '2024-05-21');
INSERT INTO `cjxx` VALUES ('11', '薛佳慧', '1', '64', '64', '2024-05-17');
INSERT INTO `cjxx` VALUES ('12', '陈楚辉', '1', '56', '56', '2024-05-23');
INSERT INTO `cjxx` VALUES ('13', '陈盛渠', '1', '44', '44', '2024-05-16');
INSERT INTO `cjxx` VALUES ('14', '李泽焕', '2', '99', '99', '2024-04-24');
INSERT INTO `cjxx` VALUES ('15', '林锐龙', '2', '77', '77', '2024-04-24');
INSERT INTO `cjxx` VALUES ('16', '刘军', '2', '88', '88', '2024-04-25');
INSERT INTO `cjxx` VALUES ('17', '王梓耀', '2', '55', '55', '2024-04-25');
INSERT INTO `cjxx` VALUES ('18', '姚赞浩', '2', '44', '44', '2024-04-24');
INSERT INTO `cjxx` VALUES ('19', '余海霖', '2', '66', '66', '2024-04-25');
INSERT INTO `cjxx` VALUES ('20', '郑锦灿', '3', '99', '99', '2024-05-22');
INSERT INTO `cjxx` VALUES ('21', '小敏', '3', '33', '33', '2024-05-21');
INSERT INTO `cjxx` VALUES ('22', '小华', '3', '44', '44', '2024-05-17');
INSERT INTO `cjxx` VALUES ('23', '小丽', '3', '66', '66', '2024-05-23');
INSERT INTO `cjxx` VALUES ('24', '小芳', '3', '88', '88', '2024-05-16');
INSERT INTO `cjxx` VALUES ('25', 'madaner', '4', '99', '99', '2024-04-24');
INSERT INTO `cjxx` VALUES ('26', '小明', '4', '66', '66', '2024-04-24');
INSERT INTO `cjxx` VALUES ('27', '陈', '5', '99', '99', '2024-04-22');
INSERT INTO `cjxx` VALUES ('28', '小花', '7', '98', '98', '2024-04-23');
INSERT INTO `cjxx` VALUES ('29', 'madaner', '5', '89', '89', '2024-04-24');
INSERT INTO `cjxx` VALUES ('30', '小明', '5', '56', '56', '2024-04-24');
INSERT INTO `cjxx` VALUES ('31', '小青', '5', '87', '87', '2024-04-25');
INSERT INTO `cjxx` VALUES ('32', '李华', '5', '74', '74', '2024-04-25');
INSERT INTO `cjxx` VALUES ('33', '陈', '6', '66', '66', '2024-04-24');
INSERT INTO `cjxx` VALUES ('34', '小花', '6', '88', '88', '2024-04-25');
INSERT INTO `cjxx` VALUES ('35', '小米', '6', '75', '75', '2024-05-22');
INSERT INTO `cjxx` VALUES ('36', '小敏', '6', '65', '65', '2024-05-21');
INSERT INTO `cjxx` VALUES ('37', '小华', '6', '64', '64', '2024-05-17');
INSERT INTO `cjxx` VALUES ('38', '小丽', '7', '56', '56', '2024-05-23');
INSERT INTO `cjxx` VALUES ('39', '小芳', '7', '44', '44', '2024-05-16');
INSERT INTO `cjxx` VALUES ('40', '陈', '7', '99', '99', '2024-04-22');
INSERT INTO `cjxx` VALUES ('41', '小花', '8', '98', '98', '2024-04-23');
INSERT INTO `cjxx` VALUES ('42', 'madaner', '8', '89', '89', '2024-04-24');
INSERT INTO `cjxx` VALUES ('43', '小明', '8', '56', '56', '2024-04-24');
INSERT INTO `cjxx` VALUES ('44', '小青', '8', '87', '87', '2024-04-25');
INSERT INTO `cjxx` VALUES ('45', '李华', '8', '74', '74', '2024-04-25');
INSERT INTO `cjxx` VALUES ('46', '陈', '9', '66', '66', '2024-04-24');
INSERT INTO `cjxx` VALUES ('47', '小花', '9', '88', '88', '2024-04-25');
INSERT INTO `cjxx` VALUES ('48', '小米', '9', '75', '75', '2024-05-22');
INSERT INTO `cjxx` VALUES ('49', '小敏', '9', '65', '65', '2024-05-21');
INSERT INTO `cjxx` VALUES ('50', '小华', '9', '64', '64', '2024-05-17');
INSERT INTO `cjxx` VALUES ('51', '小丽', '9', '56', '56', '2024-05-23');

-- ----------------------------
-- Table structure for cqxxb
-- ----------------------------
DROP TABLE IF EXISTS `cqxxb`;
CREATE TABLE `cqxxb` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) DEFAULT NULL,
  `d1_1` int(11) DEFAULT 0,
  `d1_2` int(11) DEFAULT 0,
  `d1_3` int(11) DEFAULT 0,
  `d1_4` int(11) DEFAULT 0,
  `d1_5` int(11) DEFAULT 0,
  `d1_6` int(11) DEFAULT 0,
  `d1_7` int(11) DEFAULT 0,
  `d1_8` int(11) DEFAULT 0,
  `d2_1` int(11) DEFAULT 0,
  `d2_2` int(11) DEFAULT 0,
  `d2_3` int(11) DEFAULT 0,
  `d2_4` int(11) DEFAULT 0,
  `d2_5` int(11) DEFAULT 0,
  `d2_6` int(11) DEFAULT 0,
  `d2_7` int(11) DEFAULT 0,
  `d2_8` int(11) DEFAULT 0,
  `d3_1` int(11) DEFAULT 0,
  `d3_2` int(11) DEFAULT 0,
  `d3_3` int(11) DEFAULT 0,
  `d3_4` int(11) DEFAULT 0,
  `d3_5` int(11) DEFAULT 0,
  `d3_6` int(11) DEFAULT 0,
  `d3_7` int(11) DEFAULT 0,
  `d3_8` int(11) DEFAULT 0,
  `d4_1` int(11) DEFAULT 0,
  `d4_2` int(11) DEFAULT 0,
  `d4_3` int(11) DEFAULT 0,
  `d4_4` int(11) DEFAULT 0,
  `d4_5` int(11) DEFAULT 0,
  `d4_6` int(11) DEFAULT 0,
  `d4_7` int(11) DEFAULT 0,
  `d4_8` int(11) DEFAULT 0,
  `d5_1` int(11) DEFAULT 0,
  `d5_2` int(11) DEFAULT 0,
  `d5_3` int(11) DEFAULT 0,
  `d5_4` int(11) DEFAULT 0,
  `d5_5` int(11) DEFAULT 0,
  `d5_6` int(11) DEFAULT 0,
  `d5_7` int(11) DEFAULT 0,
  `d5_8` int(11) DEFAULT 0,
  `zhou` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=81 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

-- ----------------------------
-- Records of cqxxb
-- ----------------------------
INSERT INTO `cqxxb` VALUES ('1', '陈俊萍', '0', '0', '1', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第一周');
INSERT INTO `cqxxb` VALUES ('2', '黄楠敏', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第一周');
INSERT INTO `cqxxb` VALUES ('3', '刘雪琪', '0', '1', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第一周');
INSERT INTO `cqxxb` VALUES ('4', '马丹儿', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第一周');
INSERT INTO `cqxxb` VALUES ('5', '马佳柔', '0', '0', '0', '0', '1', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第一周');
INSERT INTO `cqxxb` VALUES ('6', '马嘉丽', '0', '0', '1', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第一周');
INSERT INTO `cqxxb` VALUES ('7', '马静琦', '0', '1', '1', '0', '0', '0', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第一周');
INSERT INTO `cqxxb` VALUES ('8', '马莹琦', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第一周');
INSERT INTO `cqxxb` VALUES ('9', '彭申艺', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第一周');
INSERT INTO `cqxxb` VALUES ('10', '吴文琪', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第一周');
INSERT INTO `cqxxb` VALUES ('11', '薛佳慧', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第一周');
INSERT INTO `cqxxb` VALUES ('12', '陈楚辉', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第一周');
INSERT INTO `cqxxb` VALUES ('13', '陈盛渠', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第一周');
INSERT INTO `cqxxb` VALUES ('14', '李泽焕', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第一周');
INSERT INTO `cqxxb` VALUES ('15', '林锐龙', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第一周');
INSERT INTO `cqxxb` VALUES ('16', '刘军', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第一周');
INSERT INTO `cqxxb` VALUES ('17', '王梓耀', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第一周');
INSERT INTO `cqxxb` VALUES ('18', '姚赞浩', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第一周');
INSERT INTO `cqxxb` VALUES ('19', '余海霖', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第一周');
INSERT INTO `cqxxb` VALUES ('20', '郑锦灿', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第一周');
INSERT INTO `cqxxb` VALUES ('21', '陈俊萍', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第二周');
INSERT INTO `cqxxb` VALUES ('22', '黄楠敏', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第二周');
INSERT INTO `cqxxb` VALUES ('23', '刘雪琪', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第二周');
INSERT INTO `cqxxb` VALUES ('24', '马丹儿', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第二周');
INSERT INTO `cqxxb` VALUES ('25', '马佳柔', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第二周');
INSERT INTO `cqxxb` VALUES ('26', '马嘉丽', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第二周');
INSERT INTO `cqxxb` VALUES ('27', '马静琦', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第二周');
INSERT INTO `cqxxb` VALUES ('28', '马莹琦', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第二周');
INSERT INTO `cqxxb` VALUES ('29', '彭申艺', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第二周');
INSERT INTO `cqxxb` VALUES ('30', '吴文琪', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第二周');
INSERT INTO `cqxxb` VALUES ('31', '薛佳慧', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第二周');
INSERT INTO `cqxxb` VALUES ('32', '陈楚辉', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第二周');
INSERT INTO `cqxxb` VALUES ('33', '陈盛渠', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第二周');
INSERT INTO `cqxxb` VALUES ('34', '李泽焕', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第二周');
INSERT INTO `cqxxb` VALUES ('35', '林锐龙', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第二周');
INSERT INTO `cqxxb` VALUES ('36', '刘军', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第二周');
INSERT INTO `cqxxb` VALUES ('37', '王梓耀', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第二周');
INSERT INTO `cqxxb` VALUES ('38', '姚赞浩', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第二周');
INSERT INTO `cqxxb` VALUES ('39', '余海霖', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第二周');
INSERT INTO `cqxxb` VALUES ('40', '郑锦灿', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第二周');
INSERT INTO `cqxxb` VALUES ('41', '陈俊萍', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第三周');
INSERT INTO `cqxxb` VALUES ('42', '黄楠敏', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第三周');
INSERT INTO `cqxxb` VALUES ('43', '刘雪琪', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第三周');
INSERT INTO `cqxxb` VALUES ('44', '马丹儿', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第三周');
INSERT INTO `cqxxb` VALUES ('45', '马佳柔', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第三周');
INSERT INTO `cqxxb` VALUES ('46', '马嘉丽', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第三周');
INSERT INTO `cqxxb` VALUES ('47', '马静琦', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第三周');
INSERT INTO `cqxxb` VALUES ('48', '马莹琦', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第三周');
INSERT INTO `cqxxb` VALUES ('49', '彭申艺', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第三周');
INSERT INTO `cqxxb` VALUES ('50', '吴文琪', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第三周');
INSERT INTO `cqxxb` VALUES ('51', '薛佳慧', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第三周');
INSERT INTO `cqxxb` VALUES ('52', '陈楚辉', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第三周');
INSERT INTO `cqxxb` VALUES ('53', '陈盛渠', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第三周');
INSERT INTO `cqxxb` VALUES ('54', '李泽焕', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第三周');
INSERT INTO `cqxxb` VALUES ('55', '林锐龙', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第三周');
INSERT INTO `cqxxb` VALUES ('56', '刘军', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第三周');
INSERT INTO `cqxxb` VALUES ('57', '王梓耀', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第三周');
INSERT INTO `cqxxb` VALUES ('58', '姚赞浩', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第三周');
INSERT INTO `cqxxb` VALUES ('59', '余海霖', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第三周');
INSERT INTO `cqxxb` VALUES ('60', '郑锦灿', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第三周');
INSERT INTO `cqxxb` VALUES ('61', '陈俊萍', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第四周');
INSERT INTO `cqxxb` VALUES ('62', '黄楠敏', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第四周');
INSERT INTO `cqxxb` VALUES ('63', '刘雪琪', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第四周');
INSERT INTO `cqxxb` VALUES ('64', '马丹儿', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第四周');
INSERT INTO `cqxxb` VALUES ('65', '马佳柔', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第四周');
INSERT INTO `cqxxb` VALUES ('66', '马嘉丽', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第四周');
INSERT INTO `cqxxb` VALUES ('67', '马静琦', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第四周');
INSERT INTO `cqxxb` VALUES ('68', '马莹琦', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第四周');
INSERT INTO `cqxxb` VALUES ('69', '彭申艺', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第四周');
INSERT INTO `cqxxb` VALUES ('70', '吴文琪', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第四周');
INSERT INTO `cqxxb` VALUES ('71', '薛佳慧', '0', '0', '0', '11', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第四周');
INSERT INTO `cqxxb` VALUES ('72', '陈楚辉', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第四周');
INSERT INTO `cqxxb` VALUES ('73', '陈盛渠', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第四周');
INSERT INTO `cqxxb` VALUES ('74', '李泽焕', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第四周');
INSERT INTO `cqxxb` VALUES ('75', '林锐龙', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第四周');
INSERT INTO `cqxxb` VALUES ('76', '刘军', '0', '0', '0', '11', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第四周');
INSERT INTO `cqxxb` VALUES ('77', '王梓耀', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第四周');
INSERT INTO `cqxxb` VALUES ('78', '姚赞浩', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第四周');
INSERT INTO `cqxxb` VALUES ('79', '余海霖', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第四周');
INSERT INTO `cqxxb` VALUES ('80', '郑锦灿', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '第四周');

-- ----------------------------
-- Table structure for gsqk
-- ----------------------------
DROP TABLE IF EXISTS `gsqk`;
CREATE TABLE `gsqk` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `xsname` varchar(255) DEFAULT NULL,
  `gsqk` varchar(255) DEFAULT NULL,
  `shuoming` varchar(255) DEFAULT NULL,
  `ssh` varchar(255) DEFAULT NULL,
  `gssj` date DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=26 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

-- ----------------------------
-- Records of gsqk
-- ----------------------------
INSERT INTO `gsqk` VALUES ('1', '陈俊萍', '按时归宿', '正常', '7-312', '2024-04-22');
INSERT INTO `gsqk` VALUES ('2', '黄楠敏', '按时归宿', '正常', '7-312', '2024-04-24');
INSERT INTO `gsqk` VALUES ('3', '刘雪琪', '晚归', '社团活动', '7-312', '2024-04-24');
INSERT INTO `gsqk` VALUES ('4', '马丹儿', '按时归宿', '正常', '7-311', '2024-04-23');
INSERT INTO `gsqk` VALUES ('5', '马佳柔', '按时归宿', '正常', '7-312', '2024-04-24');
INSERT INTO `gsqk` VALUES ('6', '马嘉丽', '按时归宿', '正常', '7-312', '2024-04-24');
INSERT INTO `gsqk` VALUES ('7', '马静琦', '按时归宿', '正常', '7-311', '2024-04-25');
INSERT INTO `gsqk` VALUES ('8', '马莹琦', '按时归宿', '正常', '7-311', '2024-04-25');
INSERT INTO `gsqk` VALUES ('9', '彭申艺', '按时归宿', '正常', '7-312', '2024-04-24');
INSERT INTO `gsqk` VALUES ('10', '吴文琪', '晚归', '社团活动', '7-312', '2024-04-25');
INSERT INTO `gsqk` VALUES ('11', '薛佳慧', '按时归宿', '正常', '7-312', '2024-05-22');
INSERT INTO `gsqk` VALUES ('12', '陈楚辉', '按时归宿', '正常', '6-407', '2024-05-21');
INSERT INTO `gsqk` VALUES ('13', '陈盛渠', '按时归宿', '正常', '6-407', '2024-05-17');
INSERT INTO `gsqk` VALUES ('14', '李泽焕', '按时归宿', '正常', '6-407', '2024-05-23');
INSERT INTO `gsqk` VALUES ('15', '林锐龙', '按时归宿', '正常', '6-407', '2024-05-16');
INSERT INTO `gsqk` VALUES ('16', '刘军', '按时归宿', '正常', '6-407', '2024-04-24');
INSERT INTO `gsqk` VALUES ('17', '王梓耀', '晚归', '社团活动', '6-407', '2024-04-24');
INSERT INTO `gsqk` VALUES ('18', '姚赞浩', '按时归宿', '正常', '6-407', '2024-04-25');
INSERT INTO `gsqk` VALUES ('19', '余海霖', '按时归宿', '正常', '6-407', '2024-04-25');
INSERT INTO `gsqk` VALUES ('20', '郑锦灿', '按时归宿', '正常', '6-407', '2024-04-24');
INSERT INTO `gsqk` VALUES ('21', '陈俊萍', '按时归宿', '正常', '7-312', '2024-04-25');
INSERT INTO `gsqk` VALUES ('22', '黄楠敏', '按时归宿', '正常', '7-312', '2024-05-22');
INSERT INTO `gsqk` VALUES ('23', '刘雪琪', '按时归宿', '正常', '7-312', '2024-05-21');
INSERT INTO `gsqk` VALUES ('24', '马丹儿', '晚归', '社团活动', '7-311', '2024-05-17');
INSERT INTO `gsqk` VALUES ('25', '马佳柔', '按时归宿', '正常', '7-312', '2024-05-23');

-- ----------------------------
-- Table structure for kcb
-- ----------------------------
DROP TABLE IF EXISTS `kcb`;
CREATE TABLE `kcb` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) DEFAULT NULL,
  `banji` varchar(255) DEFAULT NULL,
  `xueqi` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

-- ----------------------------
-- Records of kcb
-- ----------------------------
INSERT INTO `kcb` VALUES ('1', 'C#', '22J4计网', '23-24学年度第二学期');
INSERT INTO `kcb` VALUES ('2', 'Linux', '22J4计网', '23-24学年度第二学期');
INSERT INTO `kcb` VALUES ('3', '网络配置', '22J4计网', '23-24学年度第二学期');
INSERT INTO `kcb` VALUES ('4', 'PHP', '22J4计网', '23-24学年度第二学期');
INSERT INTO `kcb` VALUES ('5', 'python', '22J4计网', '23-24学年度第二学期');
INSERT INTO `kcb` VALUES ('6', 'MSQ数据库', '22J4计网', '22-23学年度第二学期');
INSERT INTO `kcb` VALUES ('7', '网页设计', '22J4计网', '22-23学年度第二学期');
INSERT INTO `kcb` VALUES ('8', 'C语言', '22J4计网', '22-23学年度第一学期');
INSERT INTO `kcb` VALUES ('9', '计算机网络基础', '22J4计网', '22-23学年度第一学期');
INSERT INTO `kcb` VALUES ('10', '工业工程', '23J4工业', '23-24学年度第一学期');
INSERT INTO `kcb` VALUES ('11', '工业设计', '23J4工业', '23-24学年度第一学期');
INSERT INTO `kcb` VALUES ('13', '机械工程制图', '23J4工业', '23-24学年度第二学期');
INSERT INTO `kcb` VALUES ('14', '生产计划与组织', '23J4工业', '23-24学年度第二学期');

-- ----------------------------
-- Table structure for kcxx
-- ----------------------------
DROP TABLE IF EXISTS `kcxx`;
CREATE TABLE `kcxx` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) DEFAULT NULL,
  `nr` varchar(255) DEFAULT NULL,
  `tp` varchar(255) DEFAULT NULL,
  `autor` varchar(255) DEFAULT NULL,
  `xueqi` varchar(255) DEFAULT NULL,
  `bjname` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

-- ----------------------------
-- Records of kcxx
-- ----------------------------
INSERT INTO `kcxx` VALUES ('1', 'C#', '这是一门编程语言的基础课，可以通过拖拽控件实现的窗口', 'a1.jpg', '陈老师', '2023-2024第二学期', '22J4计网');
INSERT INTO `kcxx` VALUES ('2', '网络配置', '这是网络ip vlan rit配置', 'a2.jpg', '陈老师', '2023-2024第二学期', '22J4计网');
INSERT INTO `kcxx` VALUES ('3', 'Linux', '这是一门操作系统', 'a3.jpg', '陈老师', '2023-2024第二学期', '22J4计网');
INSERT INTO `kcxx` VALUES ('4', 'PHP系统编程', '这是一门后端语言，开发网站，后台接口，适合中小型公司开发', 'a4.jpg', '杨老师', '2023-2024第二学期', '22J4计网');
INSERT INTO `kcxx` VALUES ('5', '综合网络布线', '接网线', 'a5.jpg', '李老师', '2023-2024第一学期', '22J4计网');
INSERT INTO `kcxx` VALUES ('6', 'JavaScript', '做一些特效轮播图', 'a6.jpg', '张老师', '2023-2024第一学期', '22J4计网');
INSERT INTO `kcxx` VALUES ('7', '操作系统', 'Windows操作系统', 'a7.jpg', '陈老师', '2023-2024第一学期', '22J4计网');
INSERT INTO `kcxx` VALUES ('8', 'python', '这是一门编程语言', 'a8.jpg', '杨老师', '2023-2024第二学期', '22J4计网');
INSERT INTO `kcxx` VALUES ('9', 'Android系统编程', '这是一款手机端APP', 'a9.jpg', '陈老师', '2023-2024第二学期', '22J4计网');

-- ----------------------------
-- Table structure for ktbx
-- ----------------------------
DROP TABLE IF EXISTS `ktbx`;
CREATE TABLE `ktbx` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `xsname` varchar(255) DEFAULT '',
  `kcid` int(11) DEFAULT NULL,
  `skqk` varchar(255) DEFAULT NULL,
  `shuoming` varchar(255) DEFAULT NULL,
  `sksj` date DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=68 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

-- ----------------------------
-- Records of ktbx
-- ----------------------------
INSERT INTO `ktbx` VALUES ('1', '陈俊萍', '1', '表现优秀', '作业完成的非常好', '2024-04-22');
INSERT INTO `ktbx` VALUES ('2', '黄楠敏', '2', '表现良好', '上课玩游戏，忘记了', '2024-04-23');
INSERT INTO `ktbx` VALUES ('3', '刘雪琪', '1', '表现良好', '总体还行', '2024-04-24');
INSERT INTO `ktbx` VALUES ('4', '马丹儿', '3', '表现良好', '上课睡觉', '2024-04-24');
INSERT INTO `ktbx` VALUES ('5', '马佳柔', '4', '表现良好', '作业完成的非常好', '2024-04-25');
INSERT INTO `ktbx` VALUES ('6', '马嘉丽', '5', '表现良好', '总体还行', '2024-04-25');
INSERT INTO `ktbx` VALUES ('7', '马静琦', '2', '表现良好', '总体还行', '2024-04-24');
INSERT INTO `ktbx` VALUES ('8', '马莹琦', '3', '表现良好', '请假', '2024-04-25');
INSERT INTO `ktbx` VALUES ('9', '彭申艺', '1', '表现良好', '总体可以', '2024-05-22');
INSERT INTO `ktbx` VALUES ('10', '吴文琪', '1', '表现良好', '总体不错', '2024-05-21');
INSERT INTO `ktbx` VALUES ('11', '薛佳慧', '1', '表现优秀', '上课聊天', '2024-05-17');
INSERT INTO `ktbx` VALUES ('12', '陈楚辉', '1', '表现良好', '总体不错', '2024-05-23');
INSERT INTO `ktbx` VALUES ('13', '陈盛渠', '1', '表现良好', '总体不错', '2024-05-16');
INSERT INTO `ktbx` VALUES ('14', '李泽焕', '2', '表现良好', '总体还行', '2024-04-24');
INSERT INTO `ktbx` VALUES ('15', '林锐龙', '2', '表现良好', '上课睡觉', '2024-04-24');
INSERT INTO `ktbx` VALUES ('16', '刘军', '2', '表现良好', '作业完成的非常好', '2024-04-25');
INSERT INTO `ktbx` VALUES ('17', '王梓耀', '2', '表现良好', '总体还行', '2024-04-25');
INSERT INTO `ktbx` VALUES ('18', '姚赞浩', '2', '表现良好', '总体还行', '2024-04-24');
INSERT INTO `ktbx` VALUES ('19', '余海霖', '2', '表现良好', '请假', '2024-04-25');
INSERT INTO `ktbx` VALUES ('20', '郑锦灿', '3', '表现良好', '总体可以', '2024-05-22');
INSERT INTO `ktbx` VALUES ('21', '陈俊萍', '3', '表现优秀', '总体不错', '2024-05-21');
INSERT INTO `ktbx` VALUES ('22', '黄楠敏', '3', '表现良好', '上课聊天', '2024-05-17');
INSERT INTO `ktbx` VALUES ('23', '刘雪琪', '3', '表现良好', '总体不错', '2024-05-23');
INSERT INTO `ktbx` VALUES ('24', '马丹儿', '3', '表现良好', '总体不错', '2024-05-16');
INSERT INTO `ktbx` VALUES ('25', '马佳柔', '4', '表现良好', '总体还行', '2024-04-24');
INSERT INTO `ktbx` VALUES ('26', '马嘉丽', '4', '表现良好', '上课睡觉', '2024-04-24');
INSERT INTO `ktbx` VALUES ('27', '马静琦', '4', '表现良好', '作业完成的非常好', '2024-04-25');
INSERT INTO `ktbx` VALUES ('28', '马莹琦', '4', '表现良好', '总体还行', '2024-04-25');
INSERT INTO `ktbx` VALUES ('29', '彭申艺', '4', '表现良好', '总体还行', '2024-04-24');
INSERT INTO `ktbx` VALUES ('30', '吴文琪', '4', '表现良好', '请假', '2024-04-25');
INSERT INTO `ktbx` VALUES ('31', '薛佳慧', '5', '表现优秀', '总体可以', '2024-05-22');
INSERT INTO `ktbx` VALUES ('32', '陈楚辉', '5', '表现良好', '总体不错', '2024-05-21');
INSERT INTO `ktbx` VALUES ('33', '陈盛渠', '5', '表现良好', '上课聊天', '2024-05-17');
INSERT INTO `ktbx` VALUES ('34', '李泽焕', '5', '表现良好', '总体不错', '2024-05-23');
INSERT INTO `ktbx` VALUES ('35', '林锐龙', '5', '表现良好', '总体不错', '2024-05-16');
INSERT INTO `ktbx` VALUES ('36', '刘军', '6', '表现良好', '总体不错', '2024-05-22');
INSERT INTO `ktbx` VALUES ('49', '王梓耀', '6', '表现良好', '总体还行', '2024-04-24');
INSERT INTO `ktbx` VALUES ('50', '姚赞浩', '6', '表现良好', '总体可以', '2024-05-22');
INSERT INTO `ktbx` VALUES ('51', '陈俊萍', '6', '表现良好', '总体可以', '2024-05-22');
INSERT INTO `ktbx` VALUES ('52', '黄楠敏', '6', '表现良好', '总体不错', '2024-05-24');
INSERT INTO `ktbx` VALUES ('53', '刘雪琪', '7', '表现优秀', '上课聊天', '2024-05-17');
INSERT INTO `ktbx` VALUES ('54', '马丹儿', '7', '表现良好', '总体可以', '2024-05-22');
INSERT INTO `ktbx` VALUES ('55', '啊呦', '7', '表现良好', '总体可以', '2024-05-22');
INSERT INTO `ktbx` VALUES ('56', '小芳', '7', '表现良好', '总体不错', '2024-05-16');
INSERT INTO `ktbx` VALUES ('57', '汤姆', '7', '表现良好', '总体不错', '2024-05-22');
INSERT INTO `ktbx` VALUES ('58', '汤姆', '8', '表现良好', '总体不错', '2024-05-22');
INSERT INTO `ktbx` VALUES ('59', 'madaner', '8', '表现良好', '总体还行', '2024-04-24');
INSERT INTO `ktbx` VALUES ('60', '小米', '8', '表现良好', '总体可以', '2024-05-22');
INSERT INTO `ktbx` VALUES ('61', '啊呦', '8', '表现良好', '总体可以', '2024-05-22');
INSERT INTO `ktbx` VALUES ('62', '小敏', '8', '表现良好', '总体不错', '2024-05-24');
INSERT INTO `ktbx` VALUES ('63', '小华', '9', '表现良好', '上课聊天', '2024-05-17');
INSERT INTO `ktbx` VALUES ('64', '小米', '9', '表现良好', '总体可以', '2024-05-22');
INSERT INTO `ktbx` VALUES ('65', '啊呦', '9', '表现良好', '总体可以', '2024-05-22');
INSERT INTO `ktbx` VALUES ('66', '小芳', '9', '表现优秀', '总体不错', '2024-05-16');
INSERT INTO `ktbx` VALUES ('67', '汤姆', '9', '表现良好', '总体不错', '2024-05-22');

-- ----------------------------
-- Table structure for ssws
-- ----------------------------
DROP TABLE IF EXISTS `ssws`;
CREATE TABLE `ssws` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) DEFAULT NULL,
  `ssws` varchar(255) DEFAULT '',
  `shuoming` varchar(255) DEFAULT '',
  `ssh` varchar(255) DEFAULT NULL,
  `djsj` date DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=21 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

-- ----------------------------
-- Records of ssws
-- ----------------------------
INSERT INTO `ssws` VALUES ('1', '陈俊萍', '干净整洁', '正常', '7-312', '2024-04-22');
INSERT INTO `ssws` VALUES ('2', '黄楠敏', '干净整洁', '正常', '7-312', '2024-04-24');
INSERT INTO `ssws` VALUES ('3', '刘雪琪', '宿舍脏乱', '已整改', '7-312', '2024-04-24');
INSERT INTO `ssws` VALUES ('4', '马丹儿', '干净整洁', '正常', '7-311', '2024-04-23');
INSERT INTO `ssws` VALUES ('5', '马佳柔', '干净整洁', '正常', '7-312', '2024-04-24');
INSERT INTO `ssws` VALUES ('6', '马嘉丽', '宿舍脏乱', '已整改', '7-312', '2024-04-24');
INSERT INTO `ssws` VALUES ('7', '马静琦', '干净整洁', '正常', '7-311', '2024-04-25');
INSERT INTO `ssws` VALUES ('8', '马莹琦', '干净整洁', '正常', '7-311', '2024-04-25');
INSERT INTO `ssws` VALUES ('9', '彭申艺', '宿舍脏乱', '已整改', '7-312', '2024-04-24');
INSERT INTO `ssws` VALUES ('10', '吴文琪', '干净整洁', '正常', '7-312', '2024-04-25');
INSERT INTO `ssws` VALUES ('11', '薛佳慧', '干净整洁', '正常', '7-312', '2024-05-22');
INSERT INTO `ssws` VALUES ('12', '陈楚辉', '宿舍脏乱', '已整改', '6-407', '2024-05-21');
INSERT INTO `ssws` VALUES ('13', '陈盛渠', '宿舍脏乱', '已整改', '6-407', '2024-05-17');
INSERT INTO `ssws` VALUES ('14', '李泽焕', '干净整洁', '正常', '6-407', '2024-05-23');
INSERT INTO `ssws` VALUES ('15', '林锐龙', '干净整洁', '正常', '6-407', '2024-05-16');
INSERT INTO `ssws` VALUES ('16', '刘军', '宿舍脏乱', '已整改', '6-407', '2024-04-24');
INSERT INTO `ssws` VALUES ('17', '王梓耀', '干净整洁', '正常', '6-407', '2024-05-23');
INSERT INTO `ssws` VALUES ('18', '姚赞浩', '干净整洁', '正常', '6-407', '2024-05-16');
INSERT INTO `ssws` VALUES ('19', '余海霖', '干净整洁', '正常', '6-407', '2024-05-23');
INSERT INTO `ssws` VALUES ('20', '郑锦灿', '干净整洁', '正常', '6-407', '2024-05-16');

-- ----------------------------
-- Table structure for students
-- ----------------------------
DROP TABLE IF EXISTS `students`;
CREATE TABLE `students` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `xuehao` varchar(255) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `xinbie` int(11) DEFAULT NULL,
  `csrq` date DEFAULT NULL,
  `rxsj` date DEFAULT NULL,
  `xueyuan` varchar(255) DEFAULT NULL,
  `banjiname` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=27 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

-- ----------------------------
-- Records of students
-- ----------------------------
INSERT INTO `students` VALUES ('1', '220301-9-4-10102', '陈俊萍', '1', '2003-06-01', '2022-09-01', '信息技术学院', '22J4计网');
INSERT INTO `students` VALUES ('2', '220301-9-4-10103', '黄楠敏', '1', '2003-06-01', '2022-09-01', '信息技术学院', '22J4计网');
INSERT INTO `students` VALUES ('3', '220301-9-4-10104', '刘雪琪', '1', '2004-05-01', '2022-09-01', '信息技术学院', '22J4计网');
INSERT INTO `students` VALUES ('4', '220301-9-4-10105', '马丹儿', '1', '2003-06-03', '2022-09-01', '信息技术学院', '22J4计网');
INSERT INTO `students` VALUES ('5', '220301-9-4-10106', '马佳柔', '1', '2003-07-11', '2022-09-01', '信息技术学院', '22J4计网');
INSERT INTO `students` VALUES ('6', '220301-9-4-10107', '马嘉丽', '1', '2003-04-09', '2023-09-01', '信息技术学院', '22J4计网');
INSERT INTO `students` VALUES ('7', '220301-9-4-10201', '刘丽丽', '0', '2003-03-05', '2023-09-01', '信息技术学院', '23J4计网');
INSERT INTO `students` VALUES ('8', '220301-9-4-10212', '小亮', '1', '2004-08-12', '2023-09-01', '信息技术学院', '23J4计网');
INSERT INTO `students` VALUES ('9', '110301-9-4-10202', '小亮', '0', '2003-06-01', '2023-09-01', '工业设计学院', '23J4工业');
INSERT INTO `students` VALUES ('10', '110301-9-4-10203', '小明', '0', '2003-06-01', '2023-09-01', '工业设计学院', '23J4工业');
INSERT INTO `students` VALUES ('11', '110301-9-4-10205', '小青', '1', '2003-06-01', '2023-09-01', '工业设计学院', '23J4工业');
INSERT INTO `students` VALUES ('12', null, 'admin', '0', '2000-06-01', null, null, null);
INSERT INTO `students` VALUES ('13', '220301-9-4-10108', '马静琦', '1', '2003-06-06', '2022-09-01', '信息技术学院', '22J4计网');
INSERT INTO `students` VALUES ('14', '220301-9-4-10109', '马莹琦', '1', '2003-06-06', '2022-09-01', '信息技术学院', '22J4计网');
INSERT INTO `students` VALUES ('15', '220301-9-4-10110', '彭申艺', '1', '2003-08-16', '2022-09-01', '信息技术学院', '22J4计网');
INSERT INTO `students` VALUES ('16', '220301-9-4-10112', '吴文琪', '1', '2003-06-15', '2022-09-01', '信息技术学院', '22J4计网');
INSERT INTO `students` VALUES ('17', '220301-9-4-10113', '薛佳慧', '1', '2004-01-06', '2022-09-01', '信息技术学院', '22J4计网');
INSERT INTO `students` VALUES ('18', '220301-9-4-10115', '陈楚辉', '0', '2003-05-13', '2022-09-01', '信息技术学院', '22J4计网');
INSERT INTO `students` VALUES ('19', '220301-9-4-10117', '陈盛渠', '0', '2003-06-06', '2022-09-01', '信息技术学院', '22J4计网');
INSERT INTO `students` VALUES ('20', '220301-9-4-10126', '李泽焕', '0', '2003-09-19', '2022-09-01', '信息技术学院', '22J4计网');
INSERT INTO `students` VALUES ('21', '220301-9-4-10128', '林锐龙', '0', '2003-11-06', '2022-09-01', '信息技术学院', '22J4计网');
INSERT INTO `students` VALUES ('22', '220301-9-4-10132', '刘军', '0', '2004-06-26', '2022-09-01', '信息技术学院', '22J4计网');
INSERT INTO `students` VALUES ('23', '220301-9-4-10135', '王梓耀', '0', '2003-08-16', '2022-09-01', '信息技术学院', '22J4计网');
INSERT INTO `students` VALUES ('24', '220301-9-4-10132', '姚赞浩', '0', '2003-06-15', '2022-09-01', '信息技术学院', '22J4计网');
INSERT INTO `students` VALUES ('25', '220301-9-4-10132', '余海霖', '0', '2004-01-06', '2022-09-01', '信息技术学院', '22J4计网');
INSERT INTO `students` VALUES ('26', '220301-9-4-10132', '郑锦灿', '0', '2003-05-13', '2022-09-01', '信息技术学院', '22J4计网');

-- ----------------------------
-- Table structure for user
-- ----------------------------
DROP TABLE IF EXISTS `user`;
CREATE TABLE `user` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(200) DEFAULT NULL,
  `password` varchar(200) DEFAULT NULL,
  `xqid` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=13 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

-- ----------------------------
-- Records of user
-- ----------------------------
INSERT INTO `user` VALUES ('1', 'admin', '123456', '999');
INSERT INTO `user` VALUES ('2', '陈俊萍', '1234', '1');
INSERT INTO `user` VALUES ('3', '马丹儿', '10086', '1');
INSERT INTO `user` VALUES ('4', '刘雪琪', '3366', '1');
INSERT INTO `user` VALUES ('5', '马嘉丽', '111666', '1');
INSERT INTO `user` VALUES ('6', '薛佳慧', '123456', '1');
INSERT INTO `user` VALUES ('7', '小青', '123456', '2');
INSERT INTO `user` VALUES ('8', '教师', '111', '999');
INSERT INTO `user` VALUES ('9', '学生', '111', '2');
INSERT INTO `user` VALUES ('10', '超级权限', '111', '999');
INSERT INTO `user` VALUES ('11', '小花', '123', '2');
INSERT INTO `user` VALUES ('12', '小明', '123', '2');

-- ----------------------------
-- Table structure for zyqkb
-- ----------------------------
DROP TABLE IF EXISTS `zyqkb`;
CREATE TABLE `zyqkb` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `xsname` varchar(255) DEFAULT NULL,
  `kcid` int(11) DEFAULT NULL,
  `zyzt` varchar(255) DEFAULT NULL,
  `shuoming` varchar(255) DEFAULT NULL,
  `tjsj` date DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=68 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

-- ----------------------------
-- Records of zyqkb
-- ----------------------------
INSERT INTO `zyqkb` VALUES ('1', '陈俊萍', '1', '提交作业', '作业完成的非常好', '2024-04-22');
INSERT INTO `zyqkb` VALUES ('2', '黄楠敏', '2', '没有提交作业', '上课玩游戏，忘记了', '2024-04-23');
INSERT INTO `zyqkb` VALUES ('3', '刘雪琪', '1', '提交作业', '总体还行', '2024-04-24');
INSERT INTO `zyqkb` VALUES ('4', '马丹儿', '3', '没有提交作业', '请假', '2024-04-24');
INSERT INTO `zyqkb` VALUES ('5', '马佳柔', '4', '提交作业', '作业完成的非常好', '2024-04-25');
INSERT INTO `zyqkb` VALUES ('6', '马嘉丽', '5', '提交作业', '总体还行', '2024-04-25');
INSERT INTO `zyqkb` VALUES ('7', '马静琦', '2', '提交作业', '总体还行', '2024-04-24');
INSERT INTO `zyqkb` VALUES ('8', '马莹琦', '3', '没有提交作业', '请假', '2024-04-25');
INSERT INTO `zyqkb` VALUES ('9', '彭申艺', '1', '提交作业', '总体可以', '2024-05-22');
INSERT INTO `zyqkb` VALUES ('10', '吴文琪', '1', '提交作业', '总体不错', '2024-05-21');
INSERT INTO `zyqkb` VALUES ('11', '薛佳慧', '1', '没有提交作业', '上课聊天', '2024-05-17');
INSERT INTO `zyqkb` VALUES ('12', '陈楚辉', '1', '提交作业', '总体不错', '2024-05-23');
INSERT INTO `zyqkb` VALUES ('13', '陈盛渠', '1', '提交作业', '总体不错', '2024-05-16');
INSERT INTO `zyqkb` VALUES ('14', '李泽焕', '2', '提交作业', '总体还行', '2024-04-24');
INSERT INTO `zyqkb` VALUES ('15', '林锐龙', '2', '没有提交作业', '上课睡觉', '2024-04-24');
INSERT INTO `zyqkb` VALUES ('16', '刘军', '2', '提交作业', '作业完成的非常好', '2024-04-25');
INSERT INTO `zyqkb` VALUES ('17', '王梓耀', '2', '提交作业', '总体还行', '2024-04-25');
INSERT INTO `zyqkb` VALUES ('18', '姚赞浩', '2', '提交作业', '总体还行', '2024-04-24');
INSERT INTO `zyqkb` VALUES ('19', '余海霖', '2', '没有提交作业', '请假', '2024-04-25');
INSERT INTO `zyqkb` VALUES ('20', '郑锦灿', '3', '提交作业', '总体可以', '2024-05-22');
INSERT INTO `zyqkb` VALUES ('21', '陈俊萍', '3', '提交作业', '总体不错', '2024-05-21');
INSERT INTO `zyqkb` VALUES ('22', '黄楠敏', '3', '没有提交作业', '上课聊天', '2024-05-17');
INSERT INTO `zyqkb` VALUES ('23', '刘雪琪', '3', '提交作业', '总体不错', '2024-05-23');
INSERT INTO `zyqkb` VALUES ('24', '马丹儿', '3', '提交作业', '总体不错', '2024-05-16');
INSERT INTO `zyqkb` VALUES ('25', '马佳柔', '4', '提交作业', '总体还行', '2024-04-24');
INSERT INTO `zyqkb` VALUES ('26', '马嘉丽', '4', '没有提交作业', '上课睡觉', '2024-04-24');
INSERT INTO `zyqkb` VALUES ('27', '马静琦', '4', '提交作业', '作业完成的非常好', '2024-04-25');
INSERT INTO `zyqkb` VALUES ('28', '马莹琦', '4', '提交作业', '总体还行', '2024-04-25');
INSERT INTO `zyqkb` VALUES ('29', '彭申艺', '4', '提交作业', '总体还行', '2024-04-24');
INSERT INTO `zyqkb` VALUES ('30', '吴文琪', '4', '没有提交作业', '请假', '2024-04-25');
INSERT INTO `zyqkb` VALUES ('31', '薛佳慧', '5', '提交作业', '总体可以', '2024-05-22');
INSERT INTO `zyqkb` VALUES ('32', '陈楚辉', '5', '提交作业', '总体不错', '2024-05-21');
INSERT INTO `zyqkb` VALUES ('33', '陈盛渠', '5', '没有提交作业', '上课聊天', '2024-05-17');
INSERT INTO `zyqkb` VALUES ('34', '李泽焕', '5', '提交作业', '总体不错', '2024-05-23');
INSERT INTO `zyqkb` VALUES ('35', '林锐龙', '5', '提交作业', '总体不错', '2024-05-16');
INSERT INTO `zyqkb` VALUES ('36', '刘军', '6', '提交作业', '总体不错', '2024-05-22');
INSERT INTO `zyqkb` VALUES ('49', '王梓耀', '6', '提交作业', '总体还行', '2024-04-24');
INSERT INTO `zyqkb` VALUES ('50', '陈俊萍', '6', '提交作业', '总体可以', '2024-05-22');
INSERT INTO `zyqkb` VALUES ('51', '黄楠敏', '6', '提交作业', '总体可以', '2024-05-22');
INSERT INTO `zyqkb` VALUES ('52', '刘雪琪', '6', '提交作业', '总体不错', '2024-05-24');
INSERT INTO `zyqkb` VALUES ('53', '马丹儿', '7', '没有提交作业', '请假', '2024-05-17');
INSERT INTO `zyqkb` VALUES ('54', '马佳柔', '7', '提交作业', '总体可以', '2024-05-22');
INSERT INTO `zyqkb` VALUES ('55', '马嘉丽', '7', '提交作业', '总体可以', '2024-05-22');
INSERT INTO `zyqkb` VALUES ('56', '马静琦', '7', '提交作业', '总体不错', '2024-05-16');
INSERT INTO `zyqkb` VALUES ('57', '马莹琦', '7', '提交作业', '总体不错', '2024-05-22');
INSERT INTO `zyqkb` VALUES ('58', '彭申艺', '8', '提交作业', '总体不错', '2024-05-22');
INSERT INTO `zyqkb` VALUES ('59', '吴文琪', '8', '提交作业', '总体还行', '2024-04-24');
INSERT INTO `zyqkb` VALUES ('60', '薛佳慧', '8', '提交作业', '总体可以', '2024-05-22');
INSERT INTO `zyqkb` VALUES ('61', '陈楚辉', '8', '提交作业', '总体可以', '2024-05-22');
INSERT INTO `zyqkb` VALUES ('62', '陈盛渠', '8', '提交作业', '总体不错', '2024-05-24');
INSERT INTO `zyqkb` VALUES ('63', '李泽焕', '9', '没有提交作业', '上课聊天', '2024-05-17');
INSERT INTO `zyqkb` VALUES ('64', '林锐龙', '9', '提交作业', '总体可以', '2024-05-22');
INSERT INTO `zyqkb` VALUES ('65', '刘军', '9', '提交作业', '总体可以', '2024-05-22');
INSERT INTO `zyqkb` VALUES ('66', '王梓耀', '9', '提交作业', '总体不错', '2024-05-16');
INSERT INTO `zyqkb` VALUES ('67', '姚赞浩', '9', '提交作业', '总体不错', '2024-05-22');
